IDEA Open Model
HangingType Enumeration
Compatible with IDEA StatiCa Beta 20.0
 Type of hanging
 Namespace: IdeaRS.OpenModel.Detail
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public enum HangingType
Public Enumeration HangingType
Members
Member name | Value | Description
StraightAnchorStraightBranches | 0 |  Straight anchor with straight branches
StraightAnchorLShapedBranches | 1 |  Straight anchor with L-shaped branches _||_
AngleAnchorStraightBranches | 2 |  Angle anchor with straight branches /\
AngleAnchorLShapedBranches | 3 |  Angle anchor with L-shaped branches _/\_
StraightAnchorSingleBar | 4 |  Straight single bar
See Also
Reference
IdeaRS.OpenModel.Detail Namespace